# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, repeats, module, args]
  [[-1, 1, Conv, [64, 3, 1]],  # 0-P1/2
    [-1,1,space_to_depth,[1]],
   [-1, 1, Conv, [128, 3, 1]],  # 2-P2/4
   [-1,1,space_to_depth,[1]],
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 1]], # 5-P3/8
   [-1,1,space_to_depth,[1]],
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 1]],  # 8-P4/16
   [-1,1,space_to_depth,[1]],
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 1]],  # 11-P5/32
   [-1,1,space_to_depth,[1]],
   [-1, 3, C3, [1024]],#13
   [-1, 1, SPPF, [1024, 5]],
  ]  # 14

# YOLOv8.0n AFPN head
head:
  [
  [[3, 4], 1, Concat, [1]],#15
  [[6, 7], 1, Concat, [1]],#16
  [[9, 10], 1, Concat, [1]],#17
  [[12, 14], 1, Concat, [1]],#18

   [15, 1, Conv, [64, 1, 1]], # 19 downsample backbone P3
   [16, 1, Conv, [128, 1, 1]], # 20 downsample backbone P4
   [17, 1, Conv, [256, 1, 1]], # 21 downsample backbone P5
   [18, 1, Conv, [512, 1, 1]], # 22 downsample backbone P5

   [[19, 20], 1, ASFF2, [64, 0]], # 23
   [[20, 21], 1, ASFF2, [128, 0]], # 24
   [[21, 22], 1, ASFF2, [256, 0]], # 25
   [-3, 1, C3, [64, False]], # 26
   [-3, 1, C3, [128, False]], # 27
   [-3, 1, C3, [256, False]], # 28

   [[26,27,28], 1, ASFF3, [64, 0]], # 29
   [[26,27,28], 1, ASFF3, [128, 1]], # 30
   [[26,27,28], 1, ASFF3, [256, 2]], # 31

   [[19, 20], 1, ASFF2, [128, 1]], # 32
   [[20, 21], 1, ASFF2, [256, 1]], # 33
   [[21, 22], 1, ASFF2, [512, 1]], # 34
   [-3, 1, C3, [128, False]], # 35
   [-3, 1, C3, [256, False]], # 36
   [-3, 1, C3, [512, False]], # 37

   [[35,36,37], 1, ASFF3, [128, 0]], # 38
   [[35,36,37], 1, ASFF3, [256, 1]], # 39
   [[35,36,37], 1, ASFF3, [512, 2]], # 40

#  [[19,4], 1, Concat, [1]],  # cat head P4
#  [-1, 1, C3, [128, False]],  # 42 (P1/8-Xsmall)

   [29, 1, Conv, [128, 3, 2]],#41
   [[38, 41,30], 1, Concat, [1]],  # cat head P4
   [-1, 2, C3, [256, False]],  # 43 (P1/8-small)

   [30, 1, Conv, [256, 3, 2]],#44
   [[39, 44,31], 1, Concat, [1]],  # cat head P5
   [-1, 2, C3, [512, False]],  # 46(P2/32-medium)

   [31, 1, Conv, [512, 3, 2]],#47
   [ [ 40, 47 ], 1, Concat, [ 1 ] ],  # cat head P5
   [ -1, 2, C3, [ 1024, False ] ],  # 49 (P3/32-large)

   [[ 43, 46,49], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
